БухЭксп/Catalogs/CW_Грузоперевозки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_Грузоперевозки</Name>
			<Comment>Грузоперевозки</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.CW_Заявки</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСделкиФ</Name>
					<Comment>Дата сделки (фактическая)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Comment>Клиент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперативныйМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Груз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МаршрутыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипоразмерыКонтейнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержитДинамическиеПараметры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Незаполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтслеживаемоеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ОтслеживаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПривязкиОборудования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьСлежение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийБюджета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перекодирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коносамент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Коносаменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыГрузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтрагентыПоБюджету</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПараметровГрузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВедущего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторыВедомых</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раскрывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторГруппы</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ХарактеристикиГрузоперевозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиГрузоперевозок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВладельца</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыСтатейПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыСтатейПланирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_Грузоперевозки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПолучитьСписокРеквизитовШапкиДляВыводаНаФорму(СоответствиеПараметров, СписокДополнительныхКолонок) Экспорт
	
	//Стандартные реквизиты 
	//Код
	СоответствиеПараметров.Вставить("ршг_Код", 		Новый Структура("ЭтоПараметр,Значение,Представление", Ложь, "Код", "Код"));
	СписокДополнительныхКолонок.Добавить("ршг_Код",	"Код", Ложь);
	
	//Наименование
	СоответствиеПараметров.Вставить("ршг_Наименование", 		Новый Структура("ЭтоПараметр,Значение,Представление", Ложь, "Наименование", "Наименование"));
	СписокДополнительныхКолонок.Добавить("ршг_Наименование",	"Наименование", Ложь);
	//---Стандартные реквизиты
	
	Для Каждого Реквизит из Метаданные.Справочники.CW_Грузоперевозки.Реквизиты Цикл
		ПредставлениеПараметра = СокрЛП(Реквизит.Синоним);
		
		Если СтрНайти(ПредставлениеПараметра,"служебное") = 0 Тогда
			СоответствиеПараметров.Вставить("ршг_"+Реквизит.имя, Новый Структура("ЭтоПараметр,Значение,Представление", Ложь, Реквизит.имя, ПредставлениеПараметра));
			СписокДополнительныхКолонок.Добавить("ршг_"+Реквизит.имя,	ПредставлениеПараметра, Ложь);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СкопироватьБюджетИзГрузоперевозки(ПараметрыПроцедуры, АдресРезультат) Экспорт
	
	Если ПараметрыПроцедуры.КопироватьСтатьиРасходов и ПараметрыПроцедуры.КопироватьСтатьиДоходов Тогда
		ВидыСтатей = 0;
	Иначе
		ВидыСтатей = ?(ПараметрыПроцедуры.КопироватьСтатьиРасходов, 1, 2);
	КонецЕсли;
	
	ЗапросСуществующиеСтатьи = Новый Запрос;
	ЗапросСуществующиеСтатьи.УстановитьПараметр("Владелец",			ПараметрыПроцедуры.Ссылка);
	ЗапросСуществующиеСтатьи.УстановитьПараметр("ВерсияБюджета",	ПараметрыПроцедуры.ВыбранныеВерсии);
	
	ЗапросСуществующиеСтатьи.Текст = "ВЫБРАТЬ
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка КАК ПлановаяСтатья,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.ВерсияБюджета КАК ВерсияБюджета,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования КАК ВидСтатьиПланирования,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Контрагент КАК Контрагент,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Номенклатура КАК Номенклатура,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Валюта КАК Валюта,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.СтавкаНДС КАК СтавкаНДС,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Организация КАК Организация
	               |ИЗ
	               |	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
	               |ГДЕ
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Владелец = &Владелец
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.ВерсияБюджета В(&ВерсияБюджета)";
	
	
	Плательщик = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
	Если ПараметрыПроцедуры.ЗаполнятьПлательщика Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Объект"				, ПараметрыПроцедуры.Ссылка);
		СтруктураПараметров.Вставить("ЭтоВариантБюджета"	, Ложь);
		СтруктураПараметров.Вставить("Контрагент"			, ПараметрыПроцедуры.Клиент);
		
		Плательщик = CW_Финансы.ВернутьПлательщика(СтруктураПараметров);
	КонецЕсли; 

	//перезаполнить(0), дополнить(1)
	Если ПараметрыПроцедуры.ПорядокЗаполненияБюджета = 0 Тогда 
		
		//Удаляем версии бюджета текущей грузоперевозки по виду статьи       
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
		               |ГДЕ
		               |	CW_ПлановыеСтатьиЗатратИДоходов.Владелец = &Владелец
		               |	И CW_ПлановыеСтатьиЗатратИДоходов.ПометкаУдаления = ЛОЖЬ
		               |	И CW_ПлановыеСтатьиЗатратИДоходов.ВерсияБюджета В (&ВерсияБюджета)
		               |	//УсловиеВидаСтатьи";
		
		Запрос.УстановитьПараметр("Владелец", 		ПараметрыПроцедуры.Ссылка);
		Запрос.УстановитьПараметр("ВерсияБюджета",	ПараметрыПроцедуры.ВыбранныеВерсии);
		
		Если ВидыСтатей = 1 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УсловиеВидаСтатьи", "И CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования = Значение(Перечисление.CW_ВидыСтатейПланирования.Расходы)");	
		КонецЕсли;                
		Если ВидыСтатей = 2 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УсловиеВидаСтатьи", "И CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования = Значение(Перечисление.CW_ВидыСтатейПланирования.Доходы)");	
		КонецЕсли;
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СтатьяОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Попытка
				СтатьяОбъект.Удалить();
			Исключение
				СтатьяОбъект.УстановитьПометкуУдаления(Истина);
			КонецПопытки;
		КонецЦикла;
		
		ЗапросСуществующиеСтатьи.Текст = СтрЗаменить(ЗапросСуществующиеСтатьи.Текст,"ВЫБРАТЬ", "ВЫБРАТЬ ПЕРВЫЕ 0");
		
	КонецЕсли;
	
	РезультатЗапроса 			= ЗапросСуществующиеСтатьи.Выполнить();
	ВыборкаСуществующиеСтатьи	= РезультатЗапроса.Выбрать();
	
	//Копируемые статьи
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка КАК ПлановаяСтатья,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования КАК ВидСтатьиПланирования,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.ВерсияБюджета КАК ВерсияБюджета,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Контрагент КАК Контрагент,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Номенклатура КАК Номенклатура,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Валюта КАК Валюта,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.СтавкаНДС КАК СтавкаНДС,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Организация КАК Организация
	               |ИЗ
	               |	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
	               |ГДЕ
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Владелец = &Грузоперевозка
	               |	//УсловиеВидаСтатьи
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.ВерсияБюджета В(&ВыбранныеВерсии)
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Грузоперевозка",		ПараметрыПроцедуры.Грузоперевозка);
	Запрос.УстановитьПараметр("ВыбранныеВерсии",	ПараметрыПроцедуры.ВыбранныеВерсии); 
	
	Если ВидыСтатей = 1 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УсловиеВидаСтатьи", "И CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования = Значение(Перечисление.CW_ВидыСтатейПланирования.Расходы)");	
	КонецЕсли;                
	Если ВидыСтатей = 2 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УсловиеВидаСтатьи", "И CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования = Значение(Перечисление.CW_ВидыСтатейПланирования.Доходы)");	
	КонецЕсли;
	
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаОбъектыКопирования = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаОбъектыКопирования.Следующий() Цикл
		ВыборкаСуществующиеСтатьи.Сбросить();
		
		СтруктураПоиска = Новый Структура("Контрагент,Номенклатура,Валюта,СтавкаНДС,Организация,ВидСтатьиПланирования,ВерсияБюджета");
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ВыборкаОбъектыКопирования);
		
		Если ПараметрыПроцедуры.ЗаполнятьПлательщика и ВыборкаОбъектыКопирования.ВидСтатьиПланирования = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы") Тогда
			СтруктураПоиска.Вставить("Контрагент", Плательщик);
		КонецЕсли;
		
		Если ВыборкаСуществующиеСтатьи.НайтиСледующий(СтруктураПоиска) Тогда
			
			Если НЕ ПараметрыПроцедуры.ПерезаполнятьСуществующиеСтатьи Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтатья = ВыборкаСуществующиеСтатьи.ПлановаяСтатья.ПолучитьОбъект();
			ЗаполнитьЗначенияСвойств(НоваяСтатья, ВыборкаОбъектыКопирования);
			
		Иначе
			НоваяСтатья = ВыборкаОбъектыКопирования.ПлановаяСтатья.Скопировать();
		КонецЕсли;
		
	
		НоваяСтатья.Владелец = ПараметрыПроцедуры.Ссылка;
		Если ПараметрыПроцедуры.ЗаполнятьПлательщика И ВыборкаОбъектыКопирования.ВидСтатьиПланирования = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы") Тогда
			НоваяСтатья.Контрагент = Плательщик;
		КонецЕсли; 
		CW_Бюджетирование.ПересчитатьСтатьюБюджетаПоКурсу(НоваяСтатья);	
		Попытка
			НоваяСтатья.Записать();
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки; 
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ПодключаемыеКоманды_ЗаполнитьБюджет(ПараметрыПроцедуры, АдресРезультата = Неопределено) Экспорт
	
	Обработка 	= _ПО.ПолучитьОбработку(ПараметрыПроцедуры.Обработка);
	Ответ 		= Обработка.ЗаполнитьБюджет(ПараметрыПроцедуры);
	
	ПоместитьВоВременноеХранилище(Ответ, АдресРезультата);

КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = Данные.CW_Представление;
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    Поля.Добавить("CW_Представление");

КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	

КонецПроцедуры

//Шаблоны стандартных писем  
Процедура ДополнитьМакросыОбъекта(ДеревоМакросов) Экспорт   
	
	ГруппаМакросов = ДеревоМакросов.Строки.Добавить();  
	ГруппаМакросов.ИндексКартинки 	= 0;
	ГруппаМакросов.Значение 		= "";
	ГруппаМакросов.Представление 	= "Грузоперевозка";
	ГруппаМакросов.ЭтоГруппа 		= Истина;
	
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Грузоперевозка]", 		"Грузоперевозка", 		4);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Заказ]", 				"Заказ",				4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Заявка]", 				"Заявка",				4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ДатаГрузоперевозки]", 	"Дата грузоперевозки", 	2); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ТипПеревозки]", 		"Тип перевозки",		4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Контрагент]", 			"Контрагент",			4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[МенеджерПродаж]", 		"Менеджер продаж",		4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ОперативныйМенеджер]", "Оперативный менеджер",	4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Груз]", 				"Груз",					4);  			
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Типоразмер]", 			"Типоразмер",			4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Маршрут]", 			"Маршрут",				4); 
	
	ГруппаПараметров = ГруппаМакросов.Строки.Добавить();  
	ГруппаПараметров.ИндексКартинки = 0;
	ГруппаПараметров.Значение 		= "";
	ГруппаПараметров.Представление 	= "Параметры";
	ГруппаПараметров.ЭтоГруппа 		= Истина;
	
	ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ДополнитьМакросыПараметровГрузоперевозок(ГруппаПараметров);
	
КонецПроцедуры 

Процедура ДобавитьСтрокуМакросов(ГруппаМакросов, Значение, Представление, ИндексКартинки)
	
	СтрокаМакроса = ГруппаМакросов.Строки.Добавить();
	СтрокаМакроса.ИндексКартинки 	= ИндексКартинки;
	СтрокаМакроса.Значение 			= Значение;
	СтрокаМакроса.Представление 	= Представление;
	СтрокаМакроса.ЭтоГруппа 		= Ложь;
	
КонецПроцедуры


Процедура ПолучитьОписаниеМакросов(Результат, ДополнительныеПараметры=Неопределено) Экспорт
	
	Результат.Вставить("[Грузоперевозка]", 		"Источник.CW_Представление");
	Результат.Вставить("[Заказ]", 				"Источник.Заказ");
	Результат.Вставить("[Заявка]", 				"Источник.Заявка");
	Результат.Вставить("[ДатаГрузоперевозки]", 	"Источник.ДатаСделкиФ");
	Результат.Вставить("[Контрагент]", 			"Источник.Клиент");
	Результат.Вставить("[ТипПеревозки]", 		"Источник.ТипПеревозки");
	Результат.Вставить("[МенеджерПродаж]", 		"Источник.МенеджерПродаж");
	Результат.Вставить("[ОперативныйМенеджер]", "Источник.ОперативныйМенеджер");
	Результат.Вставить("[Груз]",				"Источник.Груз");
	Результат.Вставить("[Типоразмер]", 			"Источник.Типоразмер");
	Результат.Вставить("[Маршрут]",				"Источник.Маршрут");

	Результат.Вставить("[ФИООтправителя]", "CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(НастройкиПользователя.ФИО, Источник.ДатаСделкиФ)");
	
	ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ОписаниеМакросовПараметровГрузоперевозок(Результат);
	
КонецПроцедуры

Функция ПолучитьЗначениеПараметра(Источник, ИдентификаторПараметра,  ПолучаемоеЗначение = "Значение", СоответствиеПараметров) Экспорт
	
	Параметр = СоответствиеПараметров.Получить(ИдентификаторПараметра);
	Если Параметр = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПараметрыГрузоперевозок.Значение КАК Значение,
	|	ПараметрыГрузоперевозок.ЗначениеПлан КАК ЗначениеПлан,
	|	ПараметрыГрузоперевозок.ЗначениеФакт КАК ЗначениеФакт
	|ИЗ
	|	РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК ПараметрыГрузоперевозок
	|ГДЕ
	|	ПараметрыГрузоперевозок.Грузоперевозка = &Грузоперевозка
	|	И ПараметрыГрузоперевозок.Параметр = &Параметр";
	
	Запрос.УстановитьПараметр("Грузоперевозка",	Источник);
	Запрос.УстановитьПараметр("Параметр",		Параметр);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗначениеПараметра = Выборка[ПолучаемоеЗначение];
	КонецЕсли;
	
	Возврат ЗначениеПараметра;

КонецФункции

//---Шаблоны стандартных писем

#КонецЕсли
